# Feature Scaling Solution Notebook

### Importing Libraries

In [1]:
import pandas as pd
import numpy as np

### Importing Dataset

In [2]:
df = pd.read_csv("Dataset_03 (1).csv")
df.head()

   Australia  Canada  Dubai  USA  Salary  YearsExperience  Purchased
0          0       0      1    0   39343              1.1          0
1          0       1      0    0   46205              1.3          1
2          0       1      0    0   37731              1.5          0
3          0       1      0    0   43525              2.0          0
4          0       0      0    1   39891              2.2          0

In [15]:

X = df.iloc[:,:-1]
print(X)
y = df.iloc[:,-1]

    Australia  Canada  Dubai  USA  Salary  YearsExperience
0           0       0      1    0   39343              1.1
1           0       1      0    0   46205              1.3
2           0       1      0    0   37731              1.5
3           0       1      0    0   43525              2.0
4           0       0      0    1   39891              2.2
5           0       0      1    0   56642              2.9
6           0       1      0    0   60150              3.0
7           1       0      0    0   54445              3.2
8           0       0      1    0   64445              3.2
9           0       0      1    0   57189              3.7
10          0       0      1    0   63218              3.9
11          0       0      0    1   55794              4.0
12          0       0      1    0   56957              4.0
13          0       1      0    0   57081              4.1
14          1       0      0    0   61111              4.5
15          0       0      0    1   67938              4.9
16          0       0      0    1   66029              5.1
17          0       1      0    0   83088              5.3
18          1       0      0    0   81363              5.9
19          0       1      0    0   93940              6.0
20          0       1      0    0   91738              6.8
21          1       0      0    0   98273              7.1
22          1       0      0    0  101302              7.9
23          1       0      0    0  113812              8.2
24          0       0      1    0  109431              8.7
25          1       0      0    0  105582              9.0
26          0       0      1    0  116969              9.5
27          0       0      0    1  112635              9.6
28          0       0      0    1  122391             10.3
29          0       1      0    0  121872             10.5

### Splitting Dataset

In [16]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test =train_test_split(X, y, test_size = 0.2, random_state = 1) 
print(X_train)

    Australia  Canada  Dubai  USA  Salary  YearsExperience
26          0       0      1    0  116969              9.5
3           0       1      0    0   43525              2.0
24          0       0      1    0  109431              8.7
22          1       0      0    0  101302              7.9
23          1       0      0    0  113812              8.2
4           0       0      0    1   39891              2.2
2           0       1      0    0   37731              1.5
25          1       0      0    0  105582              9.0
6           0       1      0    0   60150              3.0
18          1       0      0    0   81363              5.9
13          0       1      0    0   57081              4.1
7           1       0      0    0   54445              3.2
27          0       0      0    1  112635              9.6
1           0       1      0    0   46205              1.3
16          0       0      0    1   66029              5.1
0           0       0      1    0   39343              1.1
15          0       0      0    1   67938              4.9
29          0       1      0    0  121872             10.5
28          0       0      0    1  122391             10.3
9           0       0      1    0   57189              3.7
8           0       0      1    0   64445              3.2
12          0       0      1    0   56957              4.0
11          0       0      0    1   55794              4.0
5           0       0      1    0   56642              2.9

### Perform Feature Scaling

In [22]:
#Importing StandardScaler
from sklearn.preprocessing import StandardScaler
#Creating Instance of StandarScaler
sc = StandardScaler()
#Perform scaling in X_train with fit_transform.
#Here we are applying fit_transform because,
        # fit will calculate mean and standard deviation of X_train
        # transform will actually perform scaling with calculated mean and std.
        # fit_transform method does this both thing in one line of code.
X_train.iloc[:, 4:] = sc.fit_transform(X_train.iloc[:, 4:])

# Here we will only use transform because we have already calculated mean and std.
# Another reason is we don't want to know the mean and std of our test dataset As it
# Lead to information leakage.
X_test.iloc[:, 4:] = sc.transform(X_test.iloc[:, 4:])

array([2.08333333e-01, 2.50000000e-01, 2.91666667e-01, 2.50000000e-01,
       7.45300833e+04, 5.24166667e+00])

### Check it

In [25]:
X_train

,Australia,Canada,Dubai,USA,Salary,YearsExperience
count,24.000000,24.000000,24.000000,24.000000,24.000000,24.000000
mean,0.208333,0.250000,0.291667,0.250000,74530.083333,5.241667
std,0.414851,0.442326,0.464306,0.442326,29666.410548,3.127009
min,0.000000,0.000000,0.000000,0.000000,37731.000000,1.100000
25%,0.000000,0.000000,0.000000,0.000000,55456.750000,2.975000
50%,0.000000,0.000000,0.000000,0.000000,62297.500000,4.050000
75%,0.000000,0.250000,1.000000,0.250000,106544.250000,8.325000
max,1.000000,1.000000,1.000000,1.000000,122391.000000,10.500000

In [26]:
X_test

    Australia  Canada  Dubai  USA  Salary  YearsExperience
17          0       1      0    0   83088              5.3
21          1       0      0    0   98273              7.1
10          0       0      1    0   63218              3.9
19          0       1      0    0   93940              6.0
14          1       0      0    0   61111              4.5
20          0       1      0    0   91738              6.8